### Python Vs SQL

**Question**

You are given a data.csv file in the /root/customers/ directory containing information about your customers.
It has the following columns:

ID,NAME,CITY,COUNTRY,CPERSON,EMPLCNT,CONTRCNT,CONTRCOST 



where

ID: Unique id of the customer

NAME: Official customer company name 

CITY: Location city name 

COUNTRY: Location country name 

CPERSON: Email of the customer company contact person 

EMPLCNT: Customer company employees number 

CONTRCNT: Number of contracts signed with the customer 

CONTRCOST: Total amount of money paid by customer (float in format dollars.cents) 



Read and analyze the data.csv file, and output the answers to these questions:

1. How many total customers are in this data set?
2. How many customers are in each city?
3. How many customers are in each country?
4. Which country has the largest number of customers' contracts signed in it?
5. How many contracts does it have?
6. How many unique cities have at least one customer in them?


*Data Set*

ID, NAME, CITY, COUNTRY, CPERSON, EMPLCNT, CONTRCNT, CONTRCOST

00000001, Breadpot, Sydney, Australia, sample-email, 20, 100, 100

00000002, Hoviz, Manchester, UK, sample-email, 30, 550, 200

00000003, Hoviz, London, UK, sample-email, 55, 250, 400

00000004, Grenns, London, UK, sample-email, 40, 250, 600

00000005, Magnolia, Chicago, USA, sample-email, 50, 400, 200

00000006, Dozen, San Francisco, USA, sample-email, 40, 300, 500

00000007, Sun, San Francisco, USA, sample-email, 45, 350, 700

In [86]:
import pandas as pd 
import numpy as np
import pandasql as ps

In [87]:
df = pd.read_csv("C:\\Users\\dhruv\\Downloads\\data.csv")

In [88]:
df.head(5)

,ID,NAME,CITY,COUNTRY,CPERSON,EMPLCNT,CONTRCNT,CONTRCOST
0,1,Breadpot,Sydney,Australia,sample-email,20,100,100
1,2,Hoviz,Manchester,UK,sample-email,30,550,200
2,3,Hoviz,London,UK,sample-email,55,250,400
3,4,Grenns,London,UK,sample-email,40,250,600
4,5,Magnolia,Chicago,USA,sample-email,50,400,200

1. How many total customers are in this data set?

In [139]:

## Method 1 - Python


total_customers = df['ID'].nunique()
print(total_customers)

7

In [90]:
## Method 2 - SQL

total_customers_sql = ps.sqldf('''select count(distinct id) as total_customer_in_data from df''')
print(total_customers_sql)

   total_customer_in_data
0                       7

2. How many customers are in each city?

In [91]:

## Method 1 - Python

customers_in_city = df.groupby('CITY')["ID"].count().sort_values()

print(customers_in_city)

CITY
 Chicago          1
 Manchester       1
 Sydney           1
 London           2
 San Francisco    2
Name: ID, dtype: int64

In [94]:
## Method 2 - SQL

customers_in_city_sql = ps.sqldf(''' select city, count(*) from df group by city order by 2 ''')
print(customers_in_city_sql)

             CITY  count(*)
0         Chicago         1
1      Manchester         1
2          Sydney         1
3          London         2
4   San Francisco         2

3. How many customers are in each country?

In [95]:

## Method 1

customers_in_country = df.groupby('COUNTRY')["ID"].count().sort_values()

print(customers_in_country)

COUNTRY
 Australia    1
 UK           3
 USA          3
Name: ID, dtype: int64

In [96]:
## Method 2

customers_in_country_sql = ps.sqldf(''' select country, count(*) from df group by country order by 2 ''')
print(customers_in_country_sql)

      COUNTRY  count(*)
0   Australia         1
1          UK         3
2         USA         3

4. Which country has the largest number of customers' contracts signed in it?
5. How many contracts does it have?

In [120]:

## Method 1 - Python

countries_contract = df[["COUNTRY","CONTRCNT"]].groupby('COUNTRY')['CONTRCNT'].sum().sort_values(ascending = False).head(1)



print(countries_contract)

COUNTRY
 USA    1050
Name: CONTRCNT, dtype: int64

In [104]:
## Method 2 - SQL

countries_contract_sql = ps.sqldf(''' select COUNTRY, sum(CONTRCNT) from df group by 1 order by 2 desc limit 1''')
print(countries_contract_sql)

  COUNTRY  sum(CONTRCNT)
0     USA           1050

6. How many unique cities have at least one customer in them?

In [128]:
## How many unique cities have at least one customer in them?
# Method 1

unique_cities = df.groupby('CITY').ID.nunique().count()
print(unique_cities)

5

In [136]:
## Method 2

unique_cities_sql = ps.sqldf('''select count(*) from (select count(distinct id) from df group by city)''')
print(unique_cities_sql)

   count(*)
0         5